stm32duino/Arduino_Core_STM32/system/Drivers/STM32WBAxx_HAL_Driver/Src/stm32wbaxx_ll_rcc.c
/**
  ******************************************************************************
  * @file    stm32wbaxx_ll_rcc.c
  * @author  MCD Application Team
  * @brief   RCC LL module driver.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 20223 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
#if defined(USE_FULL_LL_DRIVER)

/* Includes ------------------------------------------------------------------*/
#include "stm32wbaxx_ll_rcc.h"
#ifdef  USE_FULL_ASSERT
#include "stm32_assert.h"
#else
#define assert_param(expr) ((void)0U)
#endif
/** @addtogroup STM32WBAxx_LL_Driver
  * @{
  */

#if defined(RCC)

/** @addtogroup RCC_LL
  * @{
  */

/* Private types -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private constants ---------------------------------------------------------*/
/* Private macros ------------------------------------------------------------*/
/** @addtogroup RCC_LL_Private_Macros
  * @{
  */
#if defined(STM32WBA62xx) || defined(STM32WBA63xx) || defined(STM32WBA64xx) || defined(STM32WBA65xx) || defined (STM32WBA6Mxx)
#if defined(USART2)
#define IS_LL_RCC_USART2_CLKSOURCE(__VALUE__) ((__VALUE__) == LL_RCC_USART2_CLKSOURCE)
#else
#define IS_LL_RCC_USART2_CLKSOURCE(__VALUE__) (0)
#endif

#if defined(USART3)
#define IS_LL_RCC_USART3_CLKSOURCE(__VALUE__) ((__VALUE__) == LL_RCC_USART3_CLKSOURCE)
#else
#define IS_LL_RCC_USART3_CLKSOURCE(__VALUE__) (0)
#endif

#define IS_LL_RCC_USART_CLKSOURCE(__VALUE__) (((__VALUE__) == LL_RCC_USART1_CLKSOURCE) \
                                               || IS_LL_RCC_USART2_CLKSOURCE(__VALUE__)\
                                               || IS_LL_RCC_USART3_CLKSOURCE(__VALUE__))

#if defined(I2C1)
#define IS_LL_RCC_I2C1_CLKSOURCE(__VALUE__) ((__VALUE__) == LL_RCC_I2C1_CLKSOURCE)
#else
#define IS_LL_RCC_I2C1_CLKSOURCE(__VALUE__) (0)
#endif

#if defined(I2C2)
#define IS_LL_RCC_I2C2_CLKSOURCE(__VALUE__) ((__VALUE__) == LL_RCC_I2C2_CLKSOURCE)
#else
#define IS_LL_RCC_I2C2_CLKSOURCE(__VALUE__) (0)
#endif

#if defined(I2C4)
#define IS_LL_RCC_I2C4_CLKSOURCE(__VALUE__) ((__VALUE__) == LL_RCC_I2C4_CLKSOURCE)
#else
#define IS_LL_RCC_I2C4_CLKSOURCE(__VALUE__) (0)
#endif

#define IS_LL_RCC_I2C_CLKSOURCE(__VALUE__) (((__VALUE__) == LL_RCC_I2C3_CLKSOURCE) \
                                             || IS_LL_RCC_I2C1_CLKSOURCE(__VALUE__)\
                                             || IS_LL_RCC_I2C2_CLKSOURCE(__VALUE__)\
                                             || IS_LL_RCC_I2C4_CLKSOURCE(__VALUE__))

#if defined(SPI1)
#define IS_LL_RCC_SPI1_CLKSOURCE(__VALUE__) ((__VALUE__) == LL_RCC_SPI1_CLKSOURCE)
#else
#define IS_LL_RCC_SPI1_CLKSOURCE(__VALUE__) (0)
#endif

#if defined(SPI2)
#define IS_LL_RCC_SPI2_CLKSOURCE(__VALUE__) ((__VALUE__) == LL_RCC_SPI2_CLKSOURCE)
#else
#define IS_LL_RCC_SPI2_CLKSOURCE(__VALUE__) (0)
#endif

#define IS_LL_RCC_SPI_CLKSOURCE(__VALUE__) (((__VALUE__) == LL_RCC_SPI3_CLKSOURCE) \
                                             || IS_LL_RCC_SPI1_CLKSOURCE(__VALUE__)\
                                             || IS_LL_RCC_SPI2_CLKSOURCE(__VALUE__))

#if defined(LPTIM2)
#define IS_LL_RCC_LPTIM2_CLKSOURCE(__VALUE__) ((__VALUE__) == LL_RCC_LPTIM2_CLKSOURCE)
#else
#define IS_LL_RCC_LPTIM2_CLKSOURCE(__VALUE__) (0)
#endif

#define IS_LL_RCC_LPTIM_CLKSOURCE(__VALUE__) (((__VALUE__) == LL_RCC_LPTIM1_CLKSOURCE) \
                                               || IS_LL_RCC_LPTIM2_CLKSOURCE(__VALUE__))

#define IS_LL_RCC_LPUART_CLKSOURCE(__VALUE__) ((__VALUE__) == LL_RCC_LPUART1_CLKSOURCE)

#if defined(SAI1)
#define IS_LL_RCC_SAI_CLKSOURCE(__VALUE__)    ((__VALUE__) == LL_RCC_SAI1_CLKSOURCE)
#endif /* SAI1 */

#define IS_LL_RCC_RNG_CLKSOURCE(__VALUE__)    ((__VALUE__) == LL_RCC_RNG_CLKSOURCE)

#define IS_LL_RCC_ADC_CLKSOURCE(__VALUE__)    ((__VALUE__) == LL_RCC_ADC_CLKSOURCE)

#if defined(USB_OTG_HS)
#define IS_LL_RCC_OTG_HS_CLKSOURCE(__VALUE__) ((__VALUE__) == LL_RCC_OTG_HS_CLKSOURCE)
#endif /* USB_OTG_HS */
#else
#if defined(USART2)
#define IS_LL_RCC_USART2_CLKSOURCE(__VALUE__) ((__VALUE__) == LL_RCC_USART2_CLKSOURCE)
#else
#define IS_LL_RCC_USART2_CLKSOURCE(__VALUE__) (0)
#endif

#define IS_LL_RCC_USART_CLKSOURCE(__VALUE__) (((__VALUE__) == LL_RCC_USART1_CLKSOURCE) \
                                               || IS_LL_RCC_USART2_CLKSOURCE(__VALUE__))

#if defined(I2C1)
#define IS_LL_RCC_I2C1_CLKSOURCE(__VALUE__) ((__VALUE__) == LL_RCC_I2C1_CLKSOURCE)
#else
#define IS_LL_RCC_I2C1_CLKSOURCE(__VALUE__) (0)
#endif

#define IS_LL_RCC_I2C_CLKSOURCE(__VALUE__) (((__VALUE__) == LL_RCC_I2C3_CLKSOURCE) \
                                             || IS_LL_RCC_I2C1_CLKSOURCE(__VALUE__))

#if defined(SPI1)
#define IS_LL_RCC_SPI1_CLKSOURCE(__VALUE__) ((__VALUE__) == LL_RCC_SPI1_CLKSOURCE)
#else
#define IS_LL_RCC_SPI1_CLKSOURCE(__VALUE__) (0)
#endif

#define IS_LL_RCC_SPI_CLKSOURCE(__VALUE__) (((__VALUE__) == LL_RCC_SPI3_CLKSOURCE) \
                                             || IS_LL_RCC_SPI1_CLKSOURCE(__VALUE__))

#if defined(LPTIM2)
#define IS_LL_RCC_LPTIM2_CLKSOURCE(__VALUE__) ((__VALUE__) == LL_RCC_LPTIM2_CLKSOURCE)
#else
#define IS_LL_RCC_LPTIM2_CLKSOURCE(__VALUE__) (0)
#endif

#define IS_LL_RCC_LPTIM_CLKSOURCE(__VALUE__) (((__VALUE__) == LL_RCC_LPTIM1_CLKSOURCE) \
                                               || IS_LL_RCC_LPTIM2_CLKSOURCE(__VALUE__))

#define IS_LL_RCC_LPUART_CLKSOURCE(__VALUE__) ((__VALUE__) == LL_RCC_LPUART1_CLKSOURCE)

#if defined(SAI1)
#define IS_LL_RCC_SAI_CLKSOURCE(__VALUE__)    ((__VALUE__) == LL_RCC_SAI1_CLKSOURCE)
#endif /* SAI1 */

#define IS_LL_RCC_RNG_CLKSOURCE(__VALUE__)    ((__VALUE__) == LL_RCC_RNG_CLKSOURCE)

#define IS_LL_RCC_ADC_CLKSOURCE(__VALUE__)    ((__VALUE__) == LL_RCC_ADC_CLKSOURCE)
#endif

/**
  * @}
  */

